tap "homebrew/bundle"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Secure hashing function
brew "libb2"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CPU, RAM memory, and load monitor for use with tmux
brew "tmux-mem-cpu-load"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# GPU-accelerated terminal emulator
cask "alacritty"
# Chromium based browser
cask "arc"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
cask "font-fira-code"
cask "font-hack-nerd-font"
# Client for the Google Drive storage service
cask "google-drive"
# Keyboard customiser
cask "karabiner-elements"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Virtual machines UI using QEMU
cask "utm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
